HELYXcore-4.4.0/examples/legacy/multiphase/interIsoFoam/discInConstantFlow/Allrun
cd ${0%/*} || exit 1    # Run from this directory

# Source tutorial run functions
. $HELYX_PROJECT_DIR/bin/tools/RunFunctions

restore0Dir

runApplication blockMesh
runApplication setAlphaField

runApplication $(getApplication)
